; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	thermograph1 - mode
	spectrograph2 - mode
	thermograph0 - mode
	GroundStation1 - direction
	GroundStation0 - direction
	Star2 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon4)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 184)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 180)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star2)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation0)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 159)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 Star2)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation1)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 122)
	(= (data Phenomenon3 thermograph1) 286)
	(= (data Phenomenon4 thermograph1) 224)
	(= (data Star5 thermograph1) 128)
	(= (data Star6 thermograph1) 101)
	(= (data Star7 thermograph1) 184)
	(= (data Star8 thermograph1) 28)
	(= (data Phenomenon3 spectrograph2) 239)
	(= (data Phenomenon4 spectrograph2) 220)
	(= (data Star5 spectrograph2) 8)
	(= (data Star6 spectrograph2) 197)
	(= (data Star7 spectrograph2) 8)
	(= (data Star8 spectrograph2) 252)
	(= (data Phenomenon3 thermograph0) 241)
	(= (data Phenomenon4 thermograph0) 190)
	(= (data Star5 thermograph0) 28)
	(= (data Star6 thermograph0) 124)
	(= (data Star7 thermograph0) 92)
	(= (data Star8 thermograph0) 27)
	(= (slew_time GroundStation1 GroundStation0) 17.1)
	(= (slew_time GroundStation0 GroundStation1) 17.1)
	(= (slew_time Star2 GroundStation0) 2.722)
	(= (slew_time GroundStation0 Star2) 2.722)
	(= (slew_time Star2 GroundStation1) 0.4366)
	(= (slew_time GroundStation1 Star2) 0.4366)
	(= (slew_time Phenomenon3 GroundStation0) 50.88)
	(= (slew_time GroundStation0 Phenomenon3) 50.88)
	(= (slew_time Phenomenon3 GroundStation1) 2.308)
	(= (slew_time GroundStation1 Phenomenon3) 2.308)
	(= (slew_time Phenomenon3 Star2) 18.63)
	(= (slew_time Star2 Phenomenon3) 18.63)
	(= (slew_time Phenomenon4 GroundStation0) 42.57)
	(= (slew_time GroundStation0 Phenomenon4) 42.57)
	(= (slew_time Phenomenon4 GroundStation1) 8.958)
	(= (slew_time GroundStation1 Phenomenon4) 8.958)
	(= (slew_time Phenomenon4 Star2) 11.19)
	(= (slew_time Star2 Phenomenon4) 11.19)
	(= (slew_time Phenomenon4 Phenomenon3) 15.84)
	(= (slew_time Phenomenon3 Phenomenon4) 15.84)
	(= (slew_time Star5 GroundStation0) 88.24)
	(= (slew_time GroundStation0 Star5) 88.24)
	(= (slew_time Star5 GroundStation1) 0.7921)
	(= (slew_time GroundStation1 Star5) 0.7921)
	(= (slew_time Star5 Star2) 6.446)
	(= (slew_time Star2 Star5) 6.446)
	(= (slew_time Star5 Phenomenon3) 25)
	(= (slew_time Phenomenon3 Star5) 25)
	(= (slew_time Star5 Phenomenon4) 7.695)
	(= (slew_time Phenomenon4 Star5) 7.695)
	(= (slew_time Star6 GroundStation0) 48.65)
	(= (slew_time GroundStation0 Star6) 48.65)
	(= (slew_time Star6 GroundStation1) 42.74)
	(= (slew_time GroundStation1 Star6) 42.74)
	(= (slew_time Star6 Star2) 13.61)
	(= (slew_time Star2 Star6) 13.61)
	(= (slew_time Star6 Phenomenon3) 53.34)
	(= (slew_time Phenomenon3 Star6) 53.34)
	(= (slew_time Star6 Phenomenon4) 51.69)
	(= (slew_time Phenomenon4 Star6) 51.69)
	(= (slew_time Star6 Star5) 33.01)
	(= (slew_time Star5 Star6) 33.01)
	(= (slew_time Star7 GroundStation0) 4.528)
	(= (slew_time GroundStation0 Star7) 4.528)
	(= (slew_time Star7 GroundStation1) 43.96)
	(= (slew_time GroundStation1 Star7) 43.96)
	(= (slew_time Star7 Star2) 10.1)
	(= (slew_time Star2 Star7) 10.1)
	(= (slew_time Star7 Phenomenon3) 63.28)
	(= (slew_time Phenomenon3 Star7) 63.28)
	(= (slew_time Star7 Phenomenon4) 55.94)
	(= (slew_time Phenomenon4 Star7) 55.94)
	(= (slew_time Star7 Star5) 11.58)
	(= (slew_time Star5 Star7) 11.58)
	(= (slew_time Star7 Star6) 21.34)
	(= (slew_time Star6 Star7) 21.34)
	(= (slew_time Star8 GroundStation0) 21.58)
	(= (slew_time GroundStation0 Star8) 21.58)
	(= (slew_time Star8 GroundStation1) 32.38)
	(= (slew_time GroundStation1 Star8) 32.38)
	(= (slew_time Star8 Star2) 0.009246)
	(= (slew_time Star2 Star8) 0.009246)
	(= (slew_time Star8 Phenomenon3) 37.24)
	(= (slew_time Phenomenon3 Star8) 37.24)
	(= (slew_time Star8 Phenomenon4) 36.03)
	(= (slew_time Phenomenon4 Star8) 36.03)
	(= (slew_time Star8 Star5) 12.15)
	(= (slew_time Star5 Star8) 12.15)
	(= (slew_time Star8 Star6) 0.08052)
	(= (slew_time Star6 Star8) 0.08052)
	(= (slew_time Star8 Star7) 83.2)
	(= (slew_time Star7 Star8) 83.2)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite2 GroundStation1)
	(have_image Phenomenon3 spectrograph2)
	(have_image Phenomenon4 spectrograph2)
	(have_image Star5 thermograph0)
	(have_image Star6 thermograph1)
	(have_image Star7 spectrograph2)
	(have_image Star8 thermograph0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 star5 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 184 to 176.305, (fuel-used) from 0 to 7.695
   goals met: 1 of 8
2. (turn_to satellite1 star6 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star6)
   changed: (fuel satellite1) from 180 to 137.26, (fuel-used) from 7.695 to 50.435
   goals met: 1 of 8
3. (turn_to satellite2 groundstation1 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 159 to 158.208, (fuel-used) from 50.435 to 51.2271
   goals met: 2 of 8
4. (turn_to satellite3 star5 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 star5)
   changed: (fuel satellite3) from 122 to 121.208, (fuel-used) from 51.2271 to 52.0192
   goals met: 2 of 8
5. (turn_to satellite2 phenomenon3 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon3)
   changed: (fuel satellite2) from 158.208 to 155.9, (fuel-used) from 52.0192 to 54.3272
   goals met: 1 of 8
6. (turn_to satellite1 star8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 star8)
   changed: (fuel satellite1) from 137.26 to 137.179, (fuel-used) from 54.3272 to 54.4077
   goals met: 1 of 8
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
8. (turn_to satellite0 groundstation1 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 176.305 to 175.513, (fuel-used) from 54.4077 to 55.1998
   goals met: 0 of 8
9. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 0 of 8
10. (turn_to satellite0 star5 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 175.513 to 174.721, (fuel-used) from 55.1998 to 55.9919
   goals met: 1 of 8
11. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 8
12. (turn_to satellite1 star2 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 137.179 to 137.17, (fuel-used) from 55.9919 to 56.0012
   goals met: 1 of 8
13. (calibrate satellite1 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 1 of 8
14. (turn_to satellite1 star7 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 star7)
   changed: (fuel satellite1) from 137.17 to 127.07, (fuel-used) from 56.0012 to 66.1012
   goals met: 1 of 8
15. (turn_to satellite2 groundstation1 phenomenon3)
   deleted: (pointing satellite2 phenomenon3)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 155.9 to 153.592, (fuel-used) from 66.1012 to 68.4092
   goals met: 2 of 8
16. (take_image satellite0 star5 instrument0 thermograph0)
   added: (have_image star5 thermograph0)
   changed: (data_capacity satellite0) from 1000 to 972, (data-stored) from 0 to 28
   goals met: 3 of 8
17. (turn_to satellite0 phenomenon4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon4)
   changed: (fuel satellite0) from 174.721 to 167.026, (fuel-used) from 68.4092 to 76.1042
   goals met: 2 of 8
18. (take_image satellite0 phenomenon4 instrument0 spectrograph2)
   added: (have_image phenomenon4 spectrograph2)
   changed: (data_capacity satellite0) from 972 to 752, (data-stored) from 28 to 248
   goals met: 3 of 8
19. (turn_to satellite0 star5 phenomenon4)
   deleted: (pointing satellite0 phenomenon4)
   added: (pointing satellite0 star5)
   changed: (fuel satellite0) from 167.026 to 159.331, (fuel-used) from 76.1042 to 83.7992
   goals met: 4 of 8
20. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 4 of 8
21. (calibrate satellite2 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 4 of 8
22. (switch_off instrument2 satellite2)
   deleted: (power_on instrument2)
   added: (power_avail satellite2)
   goals met: 4 of 8
23. (turn_to satellite2 star2 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 153.592 to 153.155, (fuel-used) from 83.7992 to 84.2358
   goals met: 3 of 8
24. (turn_to satellite2 groundstation1 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 153.155 to 152.719, (fuel-used) from 84.2358 to 84.6724
   goals met: 4 of 8
25. (turn_to satellite2 star2 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 152.719 to 152.282, (fuel-used) from 84.6724 to 85.109
   goals met: 3 of 8
26. (turn_to satellite2 groundstation1 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 152.282 to 151.846, (fuel-used) from 85.109 to 85.5456
   goals met: 4 of 8
27. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 4 of 8
28. (turn_to satellite2 star8 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 151.846 to 119.466, (fuel-used) from 85.5456 to 117.926
   goals met: 3 of 8
29. (turn_to satellite2 groundstation1 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 119.466 to 87.0855, (fuel-used) from 117.926 to 150.306
   goals met: 4 of 8
30. (switch_off instrument3 satellite2)
   deleted: (power_on instrument3)
   added: (power_avail satellite2)
   goals met: 4 of 8
31. (switch_on instrument2 satellite2)
   deleted: (calibrated instrument2) (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 4 of 8
32. (calibrate satellite2 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 4 of 8
33. (turn_to satellite2 star6 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star6)
   changed: (fuel satellite2) from 87.0855 to 44.3455, (fuel-used) from 150.306 to 193.046
   goals met: 3 of 8
34. (take_image satellite2 star6 instrument2 thermograph1)
   added: (have_image star6 thermograph1)
   changed: (data_capacity satellite2) from 1000 to 899, (data-stored) from 248 to 349
   goals met: 4 of 8
35. (turn_to satellite2 star2 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 44.3455 to 30.7355, (fuel-used) from 193.046 to 206.656
   goals met: 4 of 8
36. (turn_to satellite2 star8 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 30.7355 to 30.7263, (fuel-used) from 206.656 to 206.665
   goals met: 4 of 8
37. (take_image satellite2 star8 instrument2 thermograph0)
   added: (have_image star8 thermograph0)
   changed: (data_capacity satellite2) from 899 to 872, (data-stored) from 349 to 376
   goals met: 5 of 8
38. (turn_to satellite2 star2 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star2)
   changed: (fuel satellite2) from 30.7263 to 30.717, (fuel-used) from 206.665 to 206.674
   goals met: 5 of 8
39. (turn_to satellite2 phenomenon3 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon3)
   changed: (fuel satellite2) from 30.717 to 12.087, (fuel-used) from 206.674 to 225.304
   goals met: 5 of 8
40. (take_image satellite2 phenomenon3 instrument2 spectrograph2)
   added: (have_image phenomenon3 spectrograph2)
   changed: (data_capacity satellite2) from 872 to 633, (data-stored) from 376 to 615
   goals met: 6 of 8
41. (turn_to satellite2 groundstation1 phenomenon3)
   deleted: (pointing satellite2 phenomenon3)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 12.087 to 9.77901, (fuel-used) from 225.304 to 227.612
   goals met: 7 of 8
42. (take_image satellite1 star7 instrument1 spectrograph2)
   added: (have_image star7 spectrograph2)
   changed: (data_capacity satellite1) from 1000 to 992, (data-stored) from 615 to 623
   goals met: 8 of 8
